Repository: wp-plugins/geo-my-wp
Catalog: languages/GMW-*.po
Languages: de_de

source: Settings for the main map. Define its height and width in PX or %. Choose the map type from the dropdown menu and check the "auto zoom" checkbox if you want all the markers to automatically fit within the map.
de_de: Einstellungen für die Hauptlandkarte. Bestimme deren Höhe und Breite in Pixel oder %. Wähle den Landkartentyp über das Dropdown Menü aus und überprüfe die "Auto Zoom" Auswahlbox, wenn alle Standorticons automatisch in dieser Landkarte dargestellt werden sollten.

source: height
de_de: Höhe

source: Map Type
de_de: Landkartentyp

source: Or zoom lever
de_de: Oder Zoomstufe

source: (will not count if auto zoom is checked)
de_de: (wird nicht gezählt, wenn Auto Zoom angeklickt wurde)

source: Map frame
de_de: Landkartenrahmen

source: Street
de_de: Straße

source: Apt/Suit
de_de: Appartment/Zimmer

source: City
de_de: Stadt

source: State
de_de: Bundesland

source: Zipcode
de_de: Postleitzahl

source: Country
de_de: Land

source: Phone Number
de_de: Telefonnummer

source: fax Number
de_de: Faxnummer

source: Email Address
de_de: E-Mailadresse

source: Latitude
de_de: Breitengrad

source: Longitude
de_de: Längengrad

source: Full Address
de_de: Vollständige Adresse

source: Days & Hours
de_de: Tage & Stunden

source: Use the map to drag and drop the marker to the desired location.
de_de: Nutze die Landkarte, um per Drag & Drop den Marker auf den gewünschten Standort zu ziehen.

source: Locate Me
de_de: Stelle meinen Standort fest

source: Address
de_de: Adresse

source: Latitude / Longitude
de_de: Breiten- / Längengrad

source: Fill out the Latitude and Longitude fields and click on "Get Address" to retrive the address of the location.
de_de: Editiere die Eingabefelder für den Längen- und Breitengrad und klicke auf "Erhalte die Adresse", um die Adresse des Standortes zu erhalten.

source: Loading...
de_de: Wird geladen ...

source: Additional Information
de_de: Zusätzliche Informationen

source: GO
de_de: LOS

source: Get Directions
de_de: Routenplaner

source: Address:
de_de: Adresse:

source: N/A
de_de: Nicht verfügbar

source: Phone:
de_de: Telefon:

source: Website:
de_de: Internetseite:

source: - All -
de_de: - Alle -

source: per page
de_de: pro Seite

source: Page
de_de: Seite

source: of
de_de: von

source: First
de_de: Erste(r/s)

source: Prev
de_de: Vor

source: Next
de_de: Weiter

source: Last
de_de: Letzte (r/s)

source: Location
de_de: Standort

source: %s Updated his location at <a target="_blank" href="http://maps.google.com/maps?f=d&hl=en&geocode=&saddr=
de_de: %s Aktualisiere seinen Standort auf <a target="_blank" href="http://maps.google.com/maps?f=d&hl=en&geocode=&saddr=

source: Data successfully deleted!
de_de: Daten wurden erfolgreich gelöscht!

source: Data successfully saved!
de_de: Daten wurden erfolgreich gespeichert!

source: Search Location...
de_de: Standort wird gesucht...

source: Members Location
de_de: Mitglieder Standort

source: Member's Location
de_de: Standort des Mitgliedes

source: Go
de_de: Los

source: has not added a location yet
de_de: kein Standort bis jetzt hinzugefügt

source: Sorry, No members found
de_de: Entschuldigung, es wurden keine Mitglieder gefunden

source: Map Width: ( ex. 200px or 100% )
de_de: Breite der Landkarte: (bsp. 200px oder 100%)

source: Map Height: ( ex. 200px or 100% )
de_de: Höhe der Landkarte (bsp. 200px oder 100%)

source: Show Directions Link.
de_de: Anzeigen des Routenplaner Links

source: Show Address.
de_de: Anzeigen der Adresse.

source: Show "No location" message.
de_de: Anzeigen der "Kein Standort" Nachricht

source: Friends Locator ( Require: Buddypress plugin )
de_de: Friends Locator ( Benötigt: Buddypress plugin )

source: This feature will allow your Buddypress members add their location to their profile and for you to create a members search form. Using that , members will be able to search for other members based on a given address and distance.
de_de: Diese Funktion erlaubt es Buddypress Mitgliedern ihren Standort zu ihrem Profile hinzuzufügen und für Dich ermöglicht es das Erstellen eines Suchformulares. Wenn Du diese Funktion nutzt, dann sind alle Mitglieder in der Lage nach andere Mitglieder auf Basis der angegebenen Adresse und Entfernung zu suchen.

source: Choose the "Age Range" Field
de_de: Wähle das "Alters" Feld aus

source: Your buddypress profile fields are deactivated. To activate and use them <a href="
de_de: Deine Buddypress Profilfelder sind deaktiviert. Um sie zu aktivieren und zu nutzen, <a href="

source: Friends Locator ( Buddypress) - Members Settings
de_de: Friends Locator ( Buddypress) - Mitglieder Einstellungen

source: GEO my WP Friends Locator add-on database tables must be updated. Please Backup your database before updating it.
de_de: GEO my WP Friends Locator Add-on Datenbanktabellen müssen aktualisiert werden. Bitte erstelle ein Backup Deiner Datenbank bevor Du aktualisierst.

source: Xprofile fields
de_de: Xprofile Felder

source: Choose the Xprofile fields that you want to display in the search form. You can choose one or more Xprofile fields created using checkboxs, select box and multiselect box that will all be displayed as checkboxes. You can also choose one Xprofile field created using date field for the age range field.
de_de: Wähle die Xprofile Felder aus, die Du im Suchformular anzeigen lassen möchtest. Du kannst ein oder mehrere erstellte Xprofile Felder über Auswahlboxen, Auswahlmenü oder Mehrfachauswahlboxen angezeigen lassen. Du kannst auch ein erstelltes Xprofile Feld als Altersangabenfeld nutzen.

source: Choose if to display the locator button in the search form. The locator button will get the user&#39;s current location and submit the search form based of the location found. you can choose one of the default icons or you can add icon of your own.
de_de: Bitte anklicken, wenn Du den "Standort Button" im Suchformular anzeigen lassen möchtest. Über die Lokalisierung wird der aktuelle Standort eines Benutzers herausgefunden, der an das Suchformular weitergeleitet wird. Du kannst Standort-Icons aus den hier verfügbaren auswählen oder eigene Icons hinzufügen.

source: -- Same Page --
de_de: -- Selbe Seite --

source: Choose The resuls template file (results.php). You can find the search results template files in the <code>plugins folder/geo-my-wp/plugin/friends/search-results</code>. You can modify any of the templates or create your own. If you do modify or create you own template files you should create/save them in your theme or child theme folder and the plugin will read them from there. This way your changes will not be removed once the plugin is updated. You will need to create the folders and save your results template there <code><strong>themes/your-theme-or-child-theme-folder/geo-my-wp/friends/search-results/your-results-theme-folder</strong></code>. Your theme folder will contain the results.php file and another folder named "css" and the style.css within it.
de_de: Wähle das Ergebnisvorlagen File (results.php) aus. Du findest die Suchergebnisvorlagen in <code>plugins folder/geo-my-wp/plugin/friends/search-results</code>. Du kannst jedes dieser Vorlagen ändern oder ein eigenes erstellen. Wenn Du eine Vorlage änderst oder eine eigene erstellst, solltest Du dieses in Deinem Design/Theme oder Childtheme order erstellen bzw. speichern. Dieses Plugin wird dann dort darauf zugreifen. Dadurch werden Deine Änderungen nicht verworfen, solltest Du das Plugin einmal aktualisieren. Du musst die Ordner erstellen und Deine erstellte Vorlage hier <code><strong>themes/your-theme-or-child-theme-folder/geo-my-wp/friends/search-results/your-results-theme-folder</strong></code>abspeichern. Dein Ordern, in dem Dein Design / Theme liegt, wird das File results.php enthalten. Im Ordner mit dem Namen "css" wird das File style.css liegen.

source: Choose how to display the search results. you can do so using map only , members only or both map and the members.
de_de: Wähle aus, wie die Suchergebnisse angezeigt werden sollen. Du kannst wählen zwischen "nur Landkarte", "nur Mitglieder" oder "beides, Landkarte und Mitglieder".

source: Both members and map
de_de: Beides, Mitglieder und Landkarte

source: Members only
de_de: Nur Mitglieder

source: Display avatar and define its width and height in PX.
de_de: Zeigt das Avatar und definiere seine Breite und Höhe in Pixel.

source: Your location
de_de: Dein Standort

source: Edit location
de_de: Eingabe des Standortes

source: Delete location
de_de: Löschen des Standortes

source: Get you current location
de_de: Deinen aktuellen Standort erhalten

source: Locate me
de_de: Lokalisiere mich

source: Find your location on the map
de_de: Finde Deinen Standort auf der Landkarte

source: Type an address for autocomplete
de_de: Tippe eine Adresse für die automatische Vervollständigung

source: Enter your location manually
de_de: Gebe Deinen Standort manuell ein

source: Get address
de_de: Erhalte die Adresse

source: Save Location
de_de: Speichere den Standort

source: Submit
de_de: Absenden

source: Showing
de_de: Anzeigen

source: out of
de_de: von

source: within
de_de: innerhalb

source: from
de_de: ab

source: Permalink to %s
de_de: Permalink zu %s

source: Leave a reply
de_de: Hinterlasse einen Kommentar

source: 1 Reply
de_de: 1 Kommentar

source: % Replies
de_de: % Kommentare

source: Continue reading <span class="meta-nav">&rarr;</span>
de_de: Weiterlesen <span class="meta-nav">&rarr;</span>

source: Pages:
de_de: Seiten:

source: About %s
de_de: Über %s

source: View all posts by %s <span class="meta-nav">&rarr;</span>
de_de: Anzeigen aller Beiträge von %s <span class="meta-nav">&rarr;</span>
