Repository: wp-plugins/geo-my-wp
Catalog: languages/GMW-*.po
Languages: de_de

source: Add-ons
de_de: Erweiterungen

source: The add-ons will add extra features to GEO my WP. You can choose to activate/deactivate any of them. Activate only the add-ons that you are going to use to have better performance. You need to check the checkboxes for the add-ons you wish to use and click on "Save Changes". If exists, the settings for those add-ons will show up in the "Settings" page.
de_de: Die Erweiterungen fügen weitere Funktionen zum Plugin Geo my WP hinzu. Du kannst auswählen, ob Du diese aktivieren oder deaktivieren möchtes. Aktiviere nur die Erweiterungen, die Du auch wirklich nutzen möchtest, um somit die Performance des Plugins zu verbessern. Du musst zum Aktivieren einer Erweiterung die entsprechende Checkbox anklicken und dann auf "Änderungen abspeichern" klicken. Falls vorhanden, werden Einstellungsmöglichkeiten für die Erweiterungen unter "Einstellungen" angezeigt.

source: Post types themes
de_de: Beitragstyp Design

source: Here you can see all the standard and custom search from and search results templates file that you can use with the shortcodes you are creating. Standard termplate files are those that comes with the plugin and custom template files are those that you can create and upload to your theme or child theme folder. This way you can be sure that any changes you are making to the files are not going to be remove when updating the plugin. The standard search forms template files located at <code><strong>geo-my-wp/plugins/posts/search-from/.</strong></code> and the search results template files at <code><strong>geo-my-wp/plugins/posts/search-results/</strong></code>. In order To use your custom template files you will need to upload (you will need create the necessary folders first) the search form template fiels to <code><strong>themes/your theme or child theme folder/geo-my-wp/posts/search-from/.</strong></code> and the search results template files to <code><strong>themes/your theme or child theme folder/geo-my-wp/posts/search-results/.</strong></code>
de_de: Hier findest Du alle Standard- und angepassten Suchformulare sowie Vorlagen für die Suchergebnisse, welche Du mittels erstellter Shortcodes nutzen kannst. Standard-Suchformulare sind die, die mit dem Plugin geliefert werden. Individuell angepasste Suchformulare sind die, die Du selbst erstellen und in den Theme (Design) oder Childtheme Ordner hochladen kannst. Auf diese Art stellst Du sicher, dass jegliche von Dir durchgeführten Änderungen durch ein Updated des Plugins verloren gehen. Die Standardvorlage für das Suchformular findest Du hier <code><strong>geo-my-wp/plugins/posts/search-from/.</strong></code> und die Vorlage für die Suchergebnisse findest Du hier <code><strong>geo-my-wp/plugins/posts/search-results/</strong></code>. Um Deine individuell angepassten Vorlagen verwenden zu können, musst Du diese in den entsprechenden Ordner (, welcher zunächst erstellt werden muss) hochladen. Die Suchformularvorlagen müssen hier abgelegt werden: <code><strong>themes/your theme or child theme folder/geo-my-wp/posts/search-from/.</strong></code> und die Suchergebnissevorlagen müssen hier abgelegt werden: <code><strong>themes/your theme or child theme folder/geo-my-wp/posts/search-results/.</strong></code>

source: Search forms template files
de_de: Suchformularvolage

source: Custom
de_de: Angepasst

source: Search results template files
de_de: Suchergebnisvorlage

source: Friends locator (Buddypress) themes
de_de: Freundeslokalisier (Buddypress) Design/Theme

source: Here you can see all the standard and custom search from and search results templates file that you can use with the shortcodes you are creating for buddypress members. Standard termplate files are those that comes with the plugin and custom template files are those that you can create and upload to your theme or child theme folder. This way you can be sure that any changes you are making to the files are not going to be remove when updating the plugin. The standard search forms template files located at <code><strong>geo-my-wp/plugins/friends/search-from/.</strong></code> and the search results template files at <code><strong>geo-my-wp/plugins/friends/search-results/</strong></code>. In order To use your custom template files you will need to upload (you will need create the necessary folders first) the search form template fiels to <code><strong>themes/your theme or child theme folder/geo-my-wp/friends/search-from/.</strong></code> and the search results template files to <code><strong>themes/your theme or child theme folder/geo-my-wp/friends/search-results/.</strong></code>
de_de: Hier siehst Du alle Standard- und individuell erstellten Suchformulare und Suchergebnisvorlagen, die Du mittels erstellter Shortcodes für Buddypress Mitglieder nutzen kannst. Standardvorlagen sind die, die mit dem Plugin mitgeliefert werden und individuell erstellte Vorlagen sind die, die Du selbst erstellt und in den Ordner Deines Designs / Themes oder Childthemes hochgeladen hast. Dadurch stellst Du sicher, dass Deine Änderungen nicht verworfen werden, wenn Du dieses Plugin aktualisierst. Die Standardsuchformulare sind hier <code><strong>geo-my-wp/plugins/friends/search-from/.</strong></code> abgelegt und die Suchergebnisvorlagen liegen hier <code><strong>geo-my-wp/plugins/friends/search-results/</strong></code>. Um Deine eigenen angebpassten Vorlagen zu nutzen, musst Du diese Suchformularvorlagen in folgenden Ordner (, der ggfls. erst noch erstellt werden muss) <code><strong>themes/your theme or child theme folder/geo-my-wp/friends/search-from/.</strong></code> kopieren. Die Suchergebnisvorlagen musst Du in diesen Ordner hochladen <code><strong>themes/your theme or child theme folder/geo-my-wp/friends/search-results/.</strong></code>

source: Settings
de_de: Einstellungen

source: Search forms
de_de: Suchformular

source: GEO my Wp - Main Settings
de_de: GEO my Wp - Haupteinstellungen

source: Developed by Eyal Fitoussi
de_de: Entwickelt von Eyal Fitoussi

source: GEO my WP - Add-ons
de_de: GEO my WP - Erweiterungen

source: Search Form - Shortcodes
de_de: Suchformular - Shortcode

source: Create new Search form
de_de: Neues Suchformular erstellen

source: Post Types
de_de: Beitragstyp

source: Buddypress Members
de_de: Buddypress Mitglied

source: Action
de_de: Aktion

source: Type
de_de: Typ

source: Edit
de_de: Eingabe

source: Duplicate
de_de: Duplizieren

source: Delete
de_de: Löschen

source: GEO my WP Licenses
de_de: GEO my WP Lizenz

source: Add-On
de_de: Erweiterungen

source: License Key
de_de: Lizenzschlüssel

source: Enter your license key
de_de: Gib hier Deinen Lizenzschlüssel

source: Deactivate
de_de: Deaktivieren

source: active
de_de: aktiv

source: Save Changes
de_de: Änderungen speichern

source: Activate
de_de: Aktivieren

source: inactive
de_de: inaktiv

source: Reset all license keys
de_de: Zurücksetzen aller Lizenzschlüssel

source: Reset
de_de: Zurücksetzen

source: General Settings
de_de: Generelle Einstellungen

source: This is optional but will let you track your API requests. you can obtain your free Goole API key <a href="https://code.google.com/apis/console/" target="_blank">here</a>.
de_de: Dies ist optional, unterstützt Dich allerdings beim Tracken Deiner API-Anfragen. Du kannst einen kostenlosen Goole API Key unter <a href="https://code.google.com/apis/console/" target="_blank">erhalten</a>.

source: Use this feature if you often get "OVER_QUERY_LIMIT" response from google when using the search form. OVER_QUERY_LIMIT happens when there are too many calls to Google API from the same IP at a very short time or when the per day limit had been used. This will prevent the address entered in the search form from being geocoded and so no results will return. You can read about Bing services and obtain your key <a href="http://www.bingmapsportal.com/application/" target="_blank">Here</a>
de_de: Nutze diese Funktion, wenn Du beim Einsatz von Suchformularen des öfteren von Google die Meldung "OVER_QUERY_LIMIT" erhälst. OVER_QUERY_LIMIT erscheint dann, wenn Du zu viele Anfragen über die Google API von der selben IP Adresse in zu kurzer Zeit gesendet werden oder wenn das Tageslimit an möglichen Anfragen über die Google API erreicht wurde. Diese Funktion schützt die in dem Suchformular eingegeben Adresse vor dem Geocoding, was bedeutet, dass keine Suchergebnisse mehr von Google gesendet werden. Du kannst Dich über den Bing Service erkundigen und einen Schlüssel <a href="http://www.bingmapsportal.com/application/" target="_blank">hier beantragen.</a>

source: Country code
de_de: Ländercode

source: Auto Locator
de_de: Automatische Lokalisierung

source: This feature will automatically try to get the user's current location when first visiting the website. If location found it will be saved via cookies and later will be used to auto display results.
de_de: Diese Funktion versucht automatisch den aktuellen Standort eines Benutzers herauszufinden, wenn diese Deine Webseite das erste Mal besucht. Wenn der Standort gefunden werden konnte, wird dieser mittels Cookies abgespeichert und später bei der automatisierten Anzeige von Ergebnissen verwendet.

source: Choose results page
de_de: Wähle eine Seite für die Suchergebnisse aus

source: This page will display the search results ( for any of your shortcode ) when using the "GMW Search Form". The plugin will first check if a results page was set in the shortcode setting and if so the results will be displayed in that page. Otherwise, if no results page was set in the shortcode setting the results will be displayed in the page you choose from the select box. Choose the page from the dropdown menu and paste the shortcode [gmw_results] into it.
de_de: Diese Seite wird die Suchergebnisse (für alle Deine verwendeten Shortcodes ) anzeigen, wenn das "GMW Suchformular" genutzt wird. Dieses Plugin wird erst überprüfen, ob in den Shortcode-Einstellungen eine Seite für Suchergebnisse ausgewählt wurde und sollte dies der Fall sein, werden die Suchergebnisse auf der Seite angezeigt. Andernfalls, sollte keine Seite für Suchergebnisse in den Shortcode-Einstellungen ausgewählt worden sein, werden die Ergebnisse in der von Dir aus der Auswahlbox ausgewählten Seite angezeigt. Wähle die Seite aus dem Dropdown Menü aus und kopiere den Shortcode [gmw_results] dort hinein.

source: Paste the shortcode
de_de: Einfügen des Shortcodes

source: - Miles -
de_de: - Meilen -

source: - Kilometers -
de_de: - Kilometer -

source: -- Within --
de_de: -- Innerhalb --

source: Miles
de_de: Meilen

source: Kilometers
de_de: Kilometer

source: Your Location
de_de: Dein Standort

source: Get your current location
de_de: Erhalte Deinen aktuellen Standort

source: - Enter Your Location -
de_de: - Gib Deinen Standort ein -

source: Widget's Title:
de_de: Widget Titel:

source: Title: (ex:"Your Location")
de_de: Titel: (bsp.:"Dein Standort")

source: Display User Name.
de_de: Zeige den Benutzernamen.

source: Display location:
de_de: Zeige den Standort:

source: Title:
de_de: Titel:

source: Choose shortcode to use in the sidebar:
de_de: Wähle den in der Sidebar zu verwendenden Shortcode aus:

source: This feature will let you add a location to any post type or pages you choose. Also you will be able to create an advance search form to let the users of your site search for locations based on post types, categories, distance and units and get detailed results near any address they enter.
de_de: Diese Funktion erlaubt es Dir einen Standort zu jedem Beitrag oder Seite auszuwälen. Des Weiteren ist es dadurch möglich ein erweitertes Suchformular zu erstellen, so dass Besucher Deiner Webseite nach in Beitragstypen, Kategorien, Entfernungen und Einheiten angegebenen Standorten suchen können und Suchergebnisse auf Basis einer eingegebenen Adresse angezeigt werden.

source: Post Types Settings
de_de: Beitragstypen-Einstellungen

source: Post types
de_de: Beitragstypen

source: Choose the post types where you want the address fields to appear. choose only the post types which you want to add a location too.
de_de: Wähle die Beitragstypen aus, bei denen das Adressfeld angezeigt werden soll. Wähle nur die Beitragstypen aus, wo Du den Standort hinzufügen möchtest.

source: Mandatory address fields
de_de: Obligatorisches Adressfeld

source: Check this box if you want to make sure that users will add location to a new post. it will prevent them from saving a post that do not have a location. Otherwise, users will be able to save a post even without a location. This way the post will be published and would show up in Wordpress search results but not in the Proximity search results.
de_de: Bitte klicke diese Box an, wenn Benutzer dazubringen möchtest, dass sie ihren Standort zu einem neuen Beitrag hinzufügen. Es bewahrt sie davor einen Beitrag abzuspeichern, ohne den Standort angegeben zu haben. Andernfalls sind Benutzer in der Lage Beiträge auch ohne Standortangabe abzuspeichern. Dadurch wird der Beitrag zwar veröffentlicht und würde auch über die "normale" WordPress-Suche zu finden sein, allerdings nicht Umkreissuche.

source: Yes
de_de: Ja

source: Thank you. GEO my WP database tables and data updated and everything seems to be ok.
de_de: Vielen Dank. GEO my WP Datenbanktabellen und Informationen wurden aktualisiert. Es scheint alles in Ordnung zu sein.

source: GEO my WP Posts Locator add-on database tables must be updated. Please Backup your database before updating it.
de_de: GEO my WP Posts Locator Add-on Datenbanktabellen müssen aktualisiert werden. Bitte erstelle ein Backup Deiner Datenbank bevor Du aktualisierst.

source: Update database
de_de: Aktualisiere Datenbank

source: Addess fields
de_de: Adressfeld

source: Type the title for the address field of the search form. for example "Enter your address". this title wll be displayed either next to the address input field or within if you check the checkbox for it. You can also choose to have the address field mandatory which will prevent users from submitting the form if no address entered. Otherwise if you allow the field to be empty and user submit a form with no address the plugin will display all results.
de_de: Gebe den Titel für das Adressfeld des Suchformulars an. Z.B. "Geben Sie Ihre Adresse ein". Dieser Titel wird entweder direkt neben oder innerhalb (, wenn Du dies ausgewählt hast) des Adresseingabefeldes angezeigt.

source: Field title
de_de: Titel des Feldes

source: zipcode, city & state or full address...
de_de: PLZ, Ort & Land oder komplette Adresse ...

source: Within the input field
de_de: Innerhalb des Eingabefeldes

source: Taxonomies/Categories
de_de: Taxonomien/Kategorien

source: Choose the taxonomies/categories that you want to display as select box in the search form.
de_de: Wähle die Taxonomien/Kategorien aus, die Du als Auswahlbox im Surchformular einzeigen lassen möchtest.

source: Exclude
de_de: Ausschließen

source: Edit Shortcode
de_de: Eingabe des Shortcodes

source: Create new shortcode
de_de: Neuen Shortcode erstellen

source: Search form
de_de: Suchformular

source: Choose the post types to use in the search form.
de_de: Wähle die Beitragstypen aus, die im Suchformular verwenden möchtest.

source: Radius values
de_de: Umkreisangabe

source: Enter distance values in the input box comma separated if you want to have a select dropdown menu of multiple radius values in the search form. If only one value entered it will be the default value of the search form which will be hidden.
de_de: Gebe hier im Eingabefeld die verschiedenen Entfernungen durch Komma getrennt ein, falls Du im Suchformular ein Dropdown Menü für verschiedene Umkreisradien haben möchtest. Wird nur ein Wert eingegeben, wird dieser der Standardwert des Suchformulares sein. Dieser Wert wird dann verborgen sein.

source: Values (comma separated)
de_de: Werte / Entfernungen (durch Komma getrennt)

source: Units
de_de: Einheiten

source: Choose if to show both type of units as a dropdown or a single default type.
de_de: Bitte anklicken, wenn Du beide Einheiten als Dropdown Menü oder als Standardeinheit anzeigen lassen möchtest.

source: Show Units
de_de: Anzeigen der Einheiten

source: Both
de_de: Beides

source: Locator icon
de_de: Standort-Icon

source: Choose if to display the locator button in the search form. The locator will get the user&#39;s current location and submit the search form based of the location found. you can choose one of the default icons or you can add icon of your own.
de_de: Bitte anklicken, wenn Du den "Standort Button" im Suchformular anzeigen lassen möchtest. Über die Lokalisierung wird der aktuelle Standort eines Benutzers herausgefunden, der an das Suchformular weitergeleitet wird. Du kannst Standort-Icons aus den hier verfügbaren auswählen oder eigene Icons hinzufügen.

source: Results
de_de: Ergebnisse

source: Results page
de_de: Seite für Suchergebnisse

source: The results page will display the search results in the selected page when using the "GMW Search Form" widget or when you want to have the search form in one page and the results showing in a different page. Choose the results page from the dropdown menu and paste the shortcode [gmw_results] into that page. To display the search result in the same page as the search form choose "Same Page" from the select box.
de_de: Die Seite mit den Ergebnissen wird die Sucherergebnisse auf der ausgewählten Seite anzeigen, wenn Du das "GMW Suchformular" Widget ausgewählt hast oder wenn Du ein das Suchformular auf einer anderen Seite als die Suchergebnisse selbst haben möchtest. Wähle die Seite für die Suchergebnisse aus dem Dropdown Menü aus und kopiere den Shortcode [gmw_results] in diese Seite hinein. Um die Suchergebnisse auf der selben Seite wie das Suchformular anzuzugeigen, wähle "Selbe Seite" aus der Auswahlbox aus.

source: Results template
de_de: Suchergebnisvorlage

source: Choose The resuls template file (results.php). You can find the search results template files in the <code>plugins folder/geo-my-wp/plugin/posts/search-results</code>. You can modify any of the templates or create your own. If you do modify or create you own template files you should create/save them in your theme or child theme folder and the plugin will read them from there. This way your changes will not be removed once the plugin is updated. You will need to create the folders and save your results template there <code><strong>themes/your-theme-or-child-theme-folder/geo-my-wp/posts/search-results/your-results-theme-folder</strong></code>. Your theme folder will contain the results.php file and another folder named "css" and the style.css within it.
de_de: Wähle das Ergebnisvorlagen File (results.php) aus. Du findest die Suchergebnisvorlagen in <code>plugins folder/geo-my-wp/plugin/posts/search-results</code>. Du kannst jedes dieser Vorlagen ändern oder ein eigenes erstellen. Wenn Du eine Vorlage änderst oder eine eigene erstellst, solltest Du dieses in Deinem Design/Theme oder Childtheme order erstellen bzw. speichern. Dieses Plugin wird dann dort darauf zugreifen. Dadurch werden Deine Änderungen nicht verworfen, solltest Du das Plugin einmal aktualisieren. Du musst die Ordner erstellen und Deine erstellte Vorlage hier <code><strong>themes/your-theme-or-child-theme-folder/geo-my-wp/posts/search-results/your-results-theme-folder</strong></code>abspeichern. Dein Ordern, in dem Dein Design / Theme liegt, wird das File results.php enthalten. Im Ordner mit dem Namen "css" wird das File style.css liegen.

source: Auto Results
de_de: Automatische Ergebnisse

source: Will automatically run initial search and display results based on the user's current location (if exists via cookies) when he/she first goes to a search page. You need to define the radius and the units for this initial search .
de_de: Wird automatisch den initialen Suchvorgang starten und die Suchergebnisse basierene auf dem Standort des Benutzer anzeigen (, wenn Cookies erlaubt sind), wenn der Benutzer das erste Mal auf das Suchformular klickt. Du musst für diesen initialen Suchvorgang den Radius der Umkreissuche und die Einheit bestimmen.

source: Results Output
de_de: Ergebnisausgabe

source: Choose how to display the search results. you can do so using map only , posts only or both map and the posts.
de_de: Wähle aus, wie die Suchergebnisse angezeigt werden sollen. Du hast die Auswahl zwischen "nur Landkarte", "nur Beiträge" oder "beides, Landkarte und Beiträge".

source: Both posts and map
de_de: Beides, Beiträge und Landkarte

source: Posts only
de_de: Nur Beiträge

source: Map only
de_de: Nur Landkarte

source: Featured image
de_de: Vorgestelltes Bild (featured image)

source: Display featured image and define its width and height in PX.
de_de: Zeige das vorgestellte Bild (featured image) und lege seine Breite und Höhe in Pixel fest.

source: Height
de_de: Höhe

source: Width
de_de: Breite

source: Additional information
de_de: Zusätzliche Informationen

source: Which fields of the additional information do you want to display for each of the results.
de_de: Welche Felder aus dem Bereich "zusätzliche Informationen" möchtest Du beim Anzeigen der Ergebnisse zeigen?

source: Phone
de_de: Telefon

source: Website
de_de: Internetseite

source: Excerpt
de_de: Auszug

source: This featured will grab the number of words that you choose from the post content and display it in each of the resuts. Set a high number (ex. 99999) if you wish to display the entire content.
de_de: Diese Funktion greift die Anzahl der Worte ab, die Du aus dem Beitragsinhalt ausgewählt hast und zeigt die Anzahl in jedem Ergebnis an. Setze den Wert auf ein hohe Zahl (bsp. 99999), wenn Du den kompleten Inhalt anzeigen lassen möchtest.

source: Words count
de_de: Wörter zählen

source: Display the taxonomies/categories for each of the results.
de_de: Anzeigen der Taxonomien/Kategorien für jedes Suchergebnis.

source: Results per page
de_de: Ergebnisse pro Seite

source: Choose the number of results per page. By setting a single value you set the default number of results per page. By giving multiple values, comma separated, a select box will be created and the users will be able to set the number of results per page.
de_de: Wähle die Anzahl der Ergebnisse pro Seite aus. Wenn Du nur einen einzigen Wert angibst, dann setzt Du den Standardwert für die Anzahl pro Seite. Wenn Du mehrere Werte, getrennt durch Kommata, angibst, wird eine Auswahlbox erstellt, durch die der Benutzer die Anzahl der Ergebnisse pro Seite selbst bestimmen kann.

source: Driving Distance
de_de: Entfernung

source: While the results showing the radius distance from the user to each of the locations, this feature let you display the exact driving distance. Please note that each driving distance request counts with google API when you can have 2500 requests per day.
de_de: Während die Ergebnisse über die Umkreissuche die Entfernung vom Benutzer zu jedem angzeigten Standort anzeigt, gibt diese Funktion die exakt zu fahrende Strecke an. Bitte beachte, dass für den Fall von max. 2500 Anfragen über die Google API jede Streckenangabe als Anfrage gezählt wird.

source: "Get Directions" link
de_de: "Routenplaner" Link

source: Display "get directions" link that will open a new window with google map that shows the exact driving direction from the user to the location.
de_de: Anzeigen des "Routenplaner" Links, welcher in einem neuen Fenster durch Google Map dargestellt wird. Dieser Routenplaner gibt den Fahrtweg vom Standort des Benutzers an.

source: Map
de_de: Landkarte

source: Map Settings
de_de: Landkarteneinstellungen
